frontend/controllers/ExpensesController.php

INSERT INTO `expenses` (`type_expense`, `costs`, `id_worker`) VALUES ('Gift', 555, 4)
---
    public function actionCreate()
    {
        $model = new Expenses();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `expenses` WHERE `id`='17'
---
    protected function findModel($id)
    {
        if (($model = Expenses::findOne(['id' => $id])) !== null) {