frontend/controllers/IncomesController.php

    public function actionIndex()
    {
        $searchModel = new IncomesSearch();
        $dataProvider = $searchModel->search($this->request->queryParams);
        $names = Worker::find()->all();
---
SELECT * FROM `worker`

    public function actionCreate()
    {
        $model = new Incomes();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `incomes` (`type_income`, `costs`, `id_worker`) VALUES ('legal job', 8000, 5)

    protected function findModel($id)
    {
        if (($model = Incomes::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `incomes` WHERE `id`='9'