frontend/controllers/WorkerController.php

SELECT * FROM `worker` WHERE `id`='5'
---
    public function actionView($id)
    {
        $incomes = Worker::find()->where(['id' => $id])->one()->getIncomes()->asArray()->all();
        $expenses = Worker::find()->where(['id' => $id])->one()->getExpenses()->asArray()->all();

INSERT INTO `worker` (`name`) VALUES ('James')
---
    public function actionCreate()
    {
        $model = new Worker();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `worker` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Worker::findOne(['id' => $id])) !== null) {

SELECT * FROM `incomes`
---
    public function incomeSum()
    {
        $sum = 0;
        $incomes = Incomes::find()->all();

SELECT * FROM `expenses`
---
    public function expensesSum()
    {
        $sum = 0;
        $incomes = Expenses::find()->all();