frontend/views/incomes/_form.php

    /* @var $form yii\widgets\ActiveForm */
    /* @var $model app\models\Worker */

    echo $form->field($model, 'id_worker')->dropdownList(
        Worker::find()->select(['name', 'id'])->indexBy('id')->column(),
        ['prompt'=>'Select Worker']
    );
---
SELECT `name`, `id` FROM `worker`